<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Intel HAXM.</string>
	<key>Identifier</key>
	<string>com.github.aranoleary.download.IntelHAXM</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Intel HAXM</string>
		<key>SEARCH_PATTERN</key>
		<string>(/download/.+/haxm-macosx.+\.zip)</string>
		<key>SEARCH_URL</key>
		<string>https://github.com/intel/haxm/releases</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>%SEARCH_URL%%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
	</array>
</dict>
</plist>
